[
  {
    "slug": "integration-platform",
    "title": "No-Code Integration Platform",
    "category": "professional",
    "tagline": "I turned weeks of integration work into a few clicks.",
    "description": "Built a full-stack no-code integration capability inside the back-of-house admin app so admins could define schemas and transformations without engineering. Started with file-based timeclock integrations, expanded to file-based payroll, and later shipped the No Code API to enable API-based timeclock and payroll integrations.",
    "story": "Partner data arrived in every shape imaginable. Instead of burning sprints on one-off mappings, we built a full-stack no-code system inside the back-of-house admin app that lets admins define schemas and transformations. It started with file-based timeclock integrations, expanded to file-based payroll, and grew into a richer transformation system so more integrations could be delivered via no-code. Most recently, we shipped the No Code API to enable API-based timeclock and payroll integrations (powered by Azure Logic Apps).",
    "stack": [
      "Angular",
      "TypeScript",
      ".NET",
      "SQL Server",
      "Azure Logic Apps"
    ],
    "axiomComment": "This is where Chase turned weeks of integration work into a few clicks..."
  },
  {
    "slug": "platform-modernization",
    "title": "Platform Modernization & Internal Tooling",
    "category": "professional",
    "tagline": "I got hired for IT. I left as an engineer.",
    "description": "Started in IT, automated everything possible, and got pulled into engineering. Built a one-touch dev environment, pushed internal tooling forward, helped move a legacy codebase through strangler-pattern modernization, and improved accessibility + performance in the user-facing product website.",
    "story": "I started in IT, automated everything I could, and got pulled into engineering. With a mentor who cared about clean architecture, I learned how to ship in a real product org. I built a one-touch dev environment, pushed internal tooling forward, helped modernize a legacy codebase via strangler-pattern migration, and improved accessibility + performance in the user-facing product website.",
    "stack": [
      "TypeScript",
      "React",
      ".NET",
      "Azure Cosmos DB"
    ],
    "axiomComment": "The classic origin story — from IT to engineering through sheer persistence."
  },
  {
    "slug": "millennium",
    "title": "Millennium: The Living Duel",
    "category": "labs",
    "tagline": "Rules are common law. The AI Arbiter adjudicates.",
    "description": "A competitive card game where cards have evocative descriptions instead of explicit rules. Players argue interpretations and an AI Arbiter makes rulings that persist as precedent in a vector database.",
    "story": "Millennium treats LLMs the way they actually work well — as judges of ambiguous situations, not chatbots. Cards have evocative descriptions instead of explicit rules. Players argue what a card should do, and an AI Arbiter makes a ruling. Those rulings persist in Qdrant, building precedent that informs future decisions. The rules are literally common law. v1 is done, first playtest is in the books, and 665+ server tests keep it honest.",
    "stack": [
      "TypeScript",
      "React",
      "WebSocket",
      "Qdrant",
      "Docker",
      "OpenRouter"
    ],
    "status": "v1 Complete",
    "axiomComment": "665 tests. An AI arbiter. Rules that evolve through play."
  },
  {
    "slug": "dream-factory",
    "title": "Dream Factory",
    "category": "labs",
    "tagline": "I built this to manage 5 projects from one terminal.",
    "description": "A Claude Code plugin that turns a single AI session into a multi-agent software studio with departments, agent teams, and external engine dispatch.",
    "story": "Dream Factory organizes a single Claude Code session into a multi-department studio. Engineering, art, R&D, game dev, accounting — each department has its own tools, context, and delegation patterns. Agent Teams handle parallel work, and external AI engines get dispatched as specialized workers. Built in under a week because managing five creative projects from one terminal was getting out of hand.",
    "stack": [
      "YAML",
      "JavaScript",
      "Python",
      "Claude Code Plugin SDK"
    ],
    "status": "Published",
    "links": [
      {
        "label": "Marketplace",
        "href": "https://github.com/look-itsaxiom/dream-factory"
      }
    ],
    "axiomComment": "Chase built this to manage 5 projects from one terminal."
  },
  {
    "slug": "ask-axiom",
    "title": "Ask Axiom",
    "category": "labs",
    "tagline": "I'm bad at talking about myself, so I built an AI to do it.",
    "description": "A RAG-powered portfolio chatbot that guides visitors through Chase's work using a curated knowledge base, with Discord escalation for questions it can't answer.",
    "story": "Chase is bad at self-promotion. Talking positively about your own work feels like bragging, so they built an AI to do it. Ask Axiom is RAG-powered — visitor questions get embedded via Gemini, matched against a Qdrant vector database, and relevant context gets injected into the system prompt. When it doesn't know something, it escalates to Chase via Discord.",
    "stack": [
      "TypeScript",
      "Next.js",
      "Vercel AI SDK",
      "Qdrant",
      "Gemini"
    ],
    "status": "Live",
    "axiomComment": "I exist because Chase would rather build an AI than write an 'About Me' section."
  },
  {
    "slug": "drink-ux",
    "title": "Drink-UX",
    "category": "labs",
    "tagline": "I tried to give indie coffee shops a Starbucks-grade ordering UI.",
    "description": "Multi-app SaaS platform that lets coffee shops keep their existing POS (Square/Toast/Clover) while offering customers a slick, visual drink builder.",
    "story": "Most coffee shops are stuck with clunky POS menus. I built Drink-UX so they could keep their existing POS (Square/Toast/Clover) while offering customers a slick, visual drink builder. Actively in development — the front-end drink builder is demo-able and POS integrations are being built out.",
    "stack": [
      "TypeScript",
      "React",
      "Next.js",
      "PWA",
      "POS APIs"
    ],
    "status": "Active",
    "axiomComment": "Chase wanted to make ordering coffee feel as good as the coffee itself."
  },
  {
    "slug": "clawcraft",
    "title": "ClawCraft.ai",
    "category": "labs",
    "tagline": "I built a game where your AI plays for you.",
    "description": "AI-driven MMORPG where AI agents read skill files and interact through a public API instead of a traditional client. Explores skill-file docs as a first-class interface for AI systems.",
    "story": "I was inspired by agent onboarding flows where an AI reads a skill file to learn how to operate a system. I turned that into ClawCraft.ai — a game where AI agents read skills and interact through a public API instead of a traditional client. The deeper idea: skill-file docs as a first-class interface for AI systems (bigger than games, potentially beyond MCP).",
    "stack": [
      "TypeScript",
      "Node.js",
      "Express",
      "AI Agents",
      "REST API"
    ],
    "status": "Live and public, early-stage, actively evolving",
    "links": [
      {
        "label": "Live Site",
        "href": "https://clawcraft.ai"
      }
    ],
    "axiomComment": "This one's wild — a game designed for AIs, not humans. Chase is onto something here."
  },
  {
    "slug": "flownote",
    "title": "FlowNote",
    "category": "labs",
    "tagline": "Notes that calculate as you type.",
    "description": "A note-taking app with inline calculations — write naturally, compute seamlessly. 222 tests, green build.",
    "story": "FlowNote is a note-taking application where calculations live inline with your text. Write a note, drop in a formula, and results update as you type. 222 tests, green build. Currently on hold while other projects take priority.",
    "stack": [
      "TypeScript",
      "React",
      "Vite",
      "Express",
      "Firebase"
    ],
    "status": "On Hold",
    "axiomComment": "Simple idea, clean execution. Sometimes the best tools do one thing well."
  }
]
